vedderb/vesc_bms_fw/ChibiOS_20.3.4/community/os/common/ext/CMSIS/HT32/HT32F523xx/ht32f523x2_reg.h
// General Purpose I/O
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t DIRCR;          //!< 0x000          Data Direction Control Register
  __IO uint32_t INER;           //!< 0x004          Input function enable register
  __IO uint32_t PUR;            //!< 0x008          Pull-Up Selection Register
  __IO uint32_t PDR;            //!< 0x00C          Pull-Down Selection Register
  __IO uint32_t ODR;            //!< 0x010          Open Drain Selection Register
  __IO uint32_t DRVR;           //!< 0x014          Drive Current Selection Register
  __IO uint32_t LOCKR;          //!< 0x018          Lock Register
  __IO uint32_t DINR;           //!< 0x01c          Data Input Register
  __IO uint32_t DOUTR;          //!< 0x020          Data Output Register
  __IO uint32_t SRR;            //!< 0x024          Output Set and Reset Control Register
  __IO uint32_t RR;             //!< 0x028          Output Reset Control Register
} GPIO_TypeDef;

// Alternate Function Input/Output
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t ESSR[2];        //!< 0x000 ~ 0x004  EXTI Source Selection Register 0 ~ 1
       uint32_t RESERVE0[6];    //!< 0x008 ~ 0x01C  Reserved
  union {
    struct {
  __IO uint32_t GPACFGR[2];     //!< 0x020 ~ 0x024  GPIO Port A Configuration Register 0 ~ 1
  __IO uint32_t GPBCFGR[2];     //!< 0x028 ~ 0x02C  GPIO Port B Configuration Register 0 ~ 1
  __IO uint32_t GPCCFGR[2];     //!< 0x030 ~ 0x034  GPIO Port C Configuration Register 0 ~ 1
  __IO uint32_t GPDCFGR[2];     //!< 0x038 ~ 0x03C  GPIO Port D Configuration Register 0 ~ 1
    };
    // alternate mapping
    struct {
  __IO uint32_t GPxCFGR[0][2];  //!< 0x020 ~ 0x03C  GPIO Port x Configuration Register 0 ~ 1
    };
  };
} AFIO_TypeDef;

// Nested Vectored Interrupt Controller
// /////////////////////////////////////////////////////////////////////////////
// Implemented in Cortex-M3 Headers

// External Interrupt/Event Controller
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t CFGR0;          //!< 0x000         EXTI Interrupt 0 Configuration Register
  __IO uint32_t CFGR1;          //!< 0x004         EXTI Interrupt 1 Configuration Register
  __IO uint32_t CFGR2;          //!< 0x008         EXTI Interrupt 2 Configuration Register
  __IO uint32_t CFGR3;          //!< 0x00C         EXTI Interrupt 3 Configuration Register
  __IO uint32_t CFGR4;          //!< 0x010         EXTI Interrupt 4 Configuration Register
  __IO uint32_t CFGR5;          //!< 0x014         EXTI Interrupt 5 Configuration Register
  __IO uint32_t CFGR6;          //!< 0x018         EXTI Interrupt 6 Configuration Register
  __IO uint32_t CFGR7;          //!< 0x01C         EXTI Interrupt 7 Configuration Register
  __IO uint32_t CFGR8;          //!< 0x020         EXTI Interrupt 8 Configuration Register
  __IO uint32_t CFGR9;          //!< 0x024         EXTI Interrupt 9 Configuration Register
  __IO uint32_t CFGR10;         //!< 0x028         EXTI Interrupt 10 Configuration Register
  __IO uint32_t CFGR11;         //!< 0x02C         EXTI Interrupt 11 Configuration Register
  __IO uint32_t CFGR12;         //!< 0x030         EXTI Interrupt 12 Configuration Register
  __IO uint32_t CFGR13;         //!< 0x034         EXTI Interrupt 13 Configuration Register
  __IO uint32_t CFGR14;         //!< 0x038         EXTI Interrupt 14 Configuration Register
  __IO uint32_t CFGR15;         //!< 0x03C         EXTI Interrupt 15 Configuration Register
  __IO uint32_t CR;             //!< 0x040         EXTI Interrupt Control Register
  __IO uint32_t EDGEFLGR;       //!< 0x044         EXTI Interrupt Edge Flag Register
  __IO uint32_t EDGESR;         //!< 0x048         EXTI Interrupt Edge Status Register
  __IO uint32_t SSCR;           //!< 0x04C         EXTI Interrupt Software Set Command Register
  __IO uint32_t WAKUPCR;        //!< 0x050         EXTI Interrupt Wakeup Control Register
  __IO uint32_t WAKUPPOLR;      //!< 0x054         EXTI Interrupt Wakeup Polarity Register
  __IO uint32_t WAKUPFLG;       //!< 0x058         EXTI Interrupt Wakeup Flag Register
} EXTI_TypeDef;

// Analog To Digital Converter
// /////////////////////////////////////////////////////////////////////////////

// Operational Amplifier / Comparator
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t CR;             //!< 0x000          Comparator Control Register
  __IO uint32_t VALR;           //!< 0x004          Comparator Voltage Reference Register
  __IO uint32_t IER;            //!< 0x008          Comparator Interrupt Enable Register
  __IO uint32_t TFR;            //!< 0x00C          Comparator Transition Flag Register
} CMP_TypeDef;


// Basic Function Timers
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t CR;             //!< 0x000          Control Register
  __IO uint32_t SR;             //!< 0x004          Status Register
  __IO uint32_t CNTR;           //!< 0x008          Counter Value Register
  __IO uint32_t CMP;            //!< 0x00C          Compare Value Register
} BFTM_TypeDef;

#define BFTM_CR_CEN                 (1U << 2)
#define BFTM_CR_OSM                 (1U << 1)
#define BFTM_CR_MIEN                (1U << 0)
#define BFTM_SR_MIF                 (1U << 0)

// General Purpose Timers
// Motor Control Timers
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t CNTCFR;         //!< 0x000          Timer Counter Configuaration Register
  __IO uint32_t MDCFR;          //!< 0x004          Timer Mode Configuration Register
  __IO uint32_t TRCFR;          //!< 0x008          Timer Trigger Configuration Register
       uint32_t RESERVED0[1];   //!< 0x00C          Reserved
  __IO uint32_t CTR;            //!< 0x010          Timer Counter Register
       uint32_t RESERVED1[3];   //!< 0x014 ~ 0x01C  Reserved
  __IO uint32_t CHnICFR[4];     //!< 0x020 ~ 0x02C  Channel n Input Configuration Register
       uint32_t RESERVED2[4];   //!< 0x030 ~ 0x03C  Reserved
  __IO uint32_t CHnOCFR[4];     //!< 0x040 ~ 0x04C  Channel n Output Configuration Register
  __IO uint32_t CHCTR;          //!< 0x050          Channel Control Register
  __IO uint32_t CHPOLR;         //!< 0x054          Channel Polarity Control Register
       uint32_t RESERVED3[5];   //!< 0x058 ~ 0x068  Reserved
  // note: only available as MCTM
  __IO uint32_t CHBRKCFR;       //!< 0x06C          Channel Break Configuration Register
  __IO uint32_t CHBRKCTR;       //!< 0x070          Channel Break Control Register
  // end note
  __IO uint32_t DICTR;          //!< 0x074          Timer PDMA/Interrupt Control Register
  __IO uint32_t EVGR;           //!< 0x078          Timer Event Generator Register
  __IO uint32_t INTSR;          //!< 0x07C          Timer Interrupt Status Register
  __IO uint32_t CNTR;           //!< 0x080          Timer Counter Register
  __IO uint32_t PSCR;           //!< 0x084          Timer Prescaler Register
  __IO uint32_t CRR;            //!< 0x088          Timer Counter Reload Register
  // note: only available as MCTM
  __IO uint32_t REPR;           //!< 0x08C          Timer Repetition Register
  // end note
  __IO uint32_t CHnCCR[4];      //!< 0x090 ~ 0x09C  Channel n Capture/Compare Register
  __IO uint32_t CHnACR[4];      //!< 0x0A0 ~ 0x0AC  Channel n Asymmentric Compare Register
} TM_TypeDef;

#define TM_CNTCFR_CMSEL_MASK        (3U << 16)
#define TM_CNTCFR_CMSEL_MODE_3      (3U << 16)
#define TM_CNTCFR_CMSEL_MODE_2      (2U << 16)
#define TM_CNTCFR_CMSEL_MODE_1      (1U << 16)
#define TM_CNTCFR_CMSEL_MODE_0      (0U << 16)
#define TM_CTR_CHCCDS               (1U << 16)
#define TM_CTR_COMUS                (1U << 9)
#define TM_CTR_COMPRE               (1U << 8)
#define TM_CTR_CRBE                 (1U << 1)
#define TM_CTR_TME                  (1U << 0)
#define TM_CHnOCFR_CHnPRE           (1U << 4)
#define TM_CHnOCFR_REFnCE           (1U << 3)
#define TM_CHnOCFR_CHnOM(n)         ((((n)>>0)&7)|((((n)>>3)&1)<<8))
#define TM_CHBRKCTR_CHMOE           (1U << 4)

// Real Time Clock
// /////////////////////////////////////////////////////////////////////////////

// Watchdog Timer
// /////////////////////////////////////////////////////////////////////////////

// I2C
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t CR;             //!< 0x000          Control Register
  __IO uint32_t IER;            //!< 0x004          Interrupt Enable Register
  __IO uint32_t ADDR;           //!< 0x008          Address Register
  __IO uint32_t SR;             //!< 0x00C          Status Register
  __IO uint32_t SHPGR;          //!< 0x010          SCL High Period Generation Register
  __IO uint32_t SLPGR;          //!< 0x014          SCL Low Period Generation Register
  __IO uint32_t DR;             //!< 0x018          Data Register
  __IO uint32_t TAR;            //!< 0x01C          Target Register
  __IO uint32_t ADDMR;          //!< 0x020          Address Mask Register
  __IO uint32_t ADDSR;          //!< 0x024          Address Snoop Register
  __IO uint32_t TOUT;           //!< 0x028          Timeout Register
} I2C_TypeDef;

