vedderb/vesc_bms_fw/ChibiOS_20.3.4/community/os/common/ext/CMSIS/HT32/HT32F523xx/ht32f523x2_reg.h
#define I2C_CR_SEQ_FILTER_MASK      (3U << 14)
#define I2C_CR_SEQ_FILTER_2_PCLK    (2U << 14)
#define I2C_CR_SEQ_FILTER_1_PCLK    (1U << 14)
#define I2C_CR_SEQ_FILTER_DISABLE   (0U << 14)
#define I2C_CR_COMB_FILTER_En       (1U << 13)
#define I2C_CR_ENTOUT               (1U << 12)
#define I2C_CR_DMANACK              (1U << 10)
#define I2C_CR_RXDMAE               (1U << 9)
#define I2C_CR_TXDMAE               (1U << 8)
#define I2C_CR_ADRM                 (1U << 7)
#define I2C_CR_I2CEN                (1U << 3)
#define I2C_CR_GCEN                 (1U << 2)
#define I2C_CR_STOP                 (1U << 1)
#define I2C_CR_AA                   (1U << 0)
#define I2C_IER_RXBFIE              (1U << 18)
#define I2C_IER_TXDEIE              (1U << 17)
#define I2C_IER_RXDNEIE             (1U << 16)
#define I2C_IER_TOUTIE              (1U << 11)
#define I2C_IER_BUSERRIE            (1U << 10)
#define I2C_IER_RXNACKIE            (1U << 9)
#define I2C_IER_ARBLOSIE            (1U << 8)
#define I2C_IER_GCSIE               (1U << 3)
#define I2C_IER_ADRSIE              (1U << 2)
#define I2C_IER_STOIE               (1U << 1)
#define I2C_IER_STAIE               (1U << 0)
#define I2C_SR_TXNRX                (1U << 21)
#define I2C_SR_MASTER               (1U << 20)
#define I2C_SR_BUSBUSY              (1U << 19)
#define I2C_SR_RXBF                 (1U << 18)
#define I2C_SR_TXDE                 (1U << 17)
#define I2C_SR_RXDNE                (1U << 16)
#define I2C_SR_TOUTF                (1U << 11)
#define I2C_SR_BUSERR               (1U << 10)
#define I2C_SR_RXNACK               (1U << 9)
#define I2C_SR_ARBLOS               (1U << 8)
#define I2C_SR_GCS                  (1U << 3)
#define I2C_SR_ADRS                 (1U << 2)
#define I2C_SR_STO                  (1U << 1)
#define I2C_SR_STA                  (1U << 0)
#define I2C_TAR_RWD                 (1U << 10)

// SPI
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t CR0;            //!< 0x000          Control Register 0
  __IO uint32_t CR1;            //!< 0x004          Control Register 1
  __IO uint32_t IER;            //!< 0x008          Interrupt Enable Register
  __IO uint32_t CPR;            //!< 0x00C          Clock Prescaler Register
  __IO uint32_t DR;             //!< 0x010          Data Register
  __IO uint32_t SR;             //!< 0x014          Status Register
  __IO uint32_t FCR;            //!< 0x018          FIFO Control Register
  __IO uint32_t FSR;            //!< 0x01C          FIFO Status Register
  __IO uint32_t FTOCR;          //!< 0x020          FIFO Time Out Counter Register
} SPI_TypeDef;

#define SPI_CR0_GUADTEN             (1U << 7)
#define SPI_CR0_DUALEN              (1U << 6)
#define SPI_CR0_SSELC               (1U << 4)
#define SPI_CR0_SELOEN              (1U << 3)
#define SPI_CR0_SPIEN               (1U << 0)
#define SPI_CR1_MODE                (1U << 14)
#define SPI_CR1_SELM                (1U << 13)
#define SPI_CR1_FIRSTBIT            (1U << 12)
#define SPI_CR1_SELAP               (1U << 11)
#define SPI_CR1_FORMAT_MASK         (7U << 8)
#define SPI_CR1_FORMAT_MODE0        (0x1U << 8)
#define SPI_CR1_FORMAT_MODE1        (0x2U << 8)
#define SPI_CR1_FORMAT_MODE2        (0x6U << 8)
#define SPI_CR1_FORMAT_MODE3        (0x5U << 8)
#define SPI_IER_RXBNEIEN            (1U << 2)
#define SPI_IER_TXBEIEN             (1U << 0)
#define SPI_SR_RXBNE                (1U << 2)
#define SPI_SR_TXE                  (1U << 1)
#define SPI_SR_TXBE                 (1U << 0)
#define SPI_FCR_FIFOEN              (1U << 10)
#define SPI_FSR_TXFS_MASK           (0xfU << 0)
#define SPI_FSR_RXFS_MASK           (0xfU << 4)

// USART
// UART
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t DR;             //!< 0x000          Data Register
  __IO uint32_t CR;             //!< 0x004          Control Register
  // Only USART
  __IO uint32_t FCR;            //!< 0x008          FIFO Control Register
  __IO uint32_t IER;            //!< 0x00C          Interrupt Enable Register
  __IO uint32_t SIFR;           //!< 0x010          Status & Interrupt Flag Register

  __IO uint32_t TPR;            //!< 0x014          Timing Parameter Register

  __IO uint32_t IrDACR;         //!< 0x018          IrDA Control Register
  __IO uint32_t RS485CR;        //!< 0x01C          RS485 Control Register
  __IO uint32_t SYNCR;          //!< 0x020          Synchronous Control Register
  // end note
  __IO uint32_t DLR;            //!< 0x024          Divider Latch Register
  __IO uint32_t TSTR;           //!< 0x028          Debug/Test Register
} USART_TypeDef;

// USART CR
#define UART_CR_MODE_MASK                 (0b11 << 0)
#define UART_CR_MODE_NORMAL               (0 << 0)
#define UART_CR_TRSM                      (1 << 2)
#define UART_CR_HFCEN                     (1 << 3)
#define UART_CR_URTXEN                    (1 << 4)
#define UART_CR_URRXEN                    (1 << 5)
#define UART_CR_TXDMAEN                   (1 << 6)
#define UART_CR_RXDMAEN                   (1 << 7)
#define UART_CR_WLS_MASK                  (0b11 << 8)
#define UART_CR_WLS_7B                    (0b00 << 8)
#define UART_CR_WLS_8B                    (0b01 << 8)
#define UART_CR_WLS_9B                    (0b10 << 8)
#define UART_CR_NSB                       (1 << 10)
#define UART_CR_PBE                       (1 << 11)
#define UART_CR_EPE                       (1 << 12)
#define UART_CR_SPE                       (1 << 13)
#define UART_CR_BCB                       (1 << 14)
#define UART_CR_RTS                       (1 << 15)
// USART FCR (FIFO CR)
#define USART_FCR_TXR               (1 << 0)
#define USART_FCR_RXR               (1 << 1)
#define USART_FCR_TXTL_MASK         (0b11 << 4)
#define USART_FCR_RXTL_MASK         (0b11 << 6)
#define USART_FCR_TXFS_MASK         (0xF << 16)
#define USART_FCR_RXFS_MASK         (0xF << 24)
// USART SIFR Status and Interrupt Flag Register
#define USART_SIFR_RXDNE        (1 << 0)
#define USART_SIFR_OEI          (1 << 1)
#define USART_SIFR_PEI          (1 << 2)
#define USART_SIFR_FEI          (1 << 3)
#define USART_SIFR_BII          (1 << 4)
#define USART_SIFR_RXDR         (1 << 5)
#define USART_SIFR_RXTOF        (1 << 6)
#define USART_SIFR_TXDE         (1 << 7)
#define USART_SIFR_TXC          (1 << 8)
#define USART_SIFR_RSADDE       (1 << 9)
#define USART_SIFR_CTSC         (1 << 10)
#define USART_SIFR_CTSS         (1 << 11)
// USART IER
#define USART_IER_RXDRIE            (1 << 0)
#define USART_IER_TXDEIE            (1 << 1)
#define USART_IER_TXCIE             (1 << 2)
#define USART_IER_OEIE              (1 << 3)
#define USART_IER_PEIE              (1 << 4)
#define USART_IER_FEIE              (1 << 5)
#define USART_IER_BIE               (1 << 6)
#define USART_IER_RSADDIE           (1 << 7)
#define USART_IER_RXTOIE            (1 << 8)
#define USART_IER_CTSIE             (1 << 9)


