vedderb/vesc_bms_fw/ChibiOS_20.3.4/community/os/common/ext/CMSIS/HT32/HT32F523xx/ht32f523x2_reg.h
// Smart Card Interface
// /////////////////////////////////////////////////////////////////////////////

// USB
// /////////////////////////////////////////////////////////////////////////////
typedef struct {
  __IO uint32_t CSR;            //!< 0x000          USB Control and Status Register
  __IO uint32_t IER;            //!< 0x004          USB Interrupt Enable Register
  __IO uint32_t ISR;            //!< 0x008          USB Interrupt Status Register
  __IO uint32_t FCR;            //!< 0x00C          USB Frame Count Register
  __IO uint32_t DEVAR;          //!< 0x010          USB Device Address Register
  struct {
    __IO uint32_t CSR;          //!< 0x014          USB Endpoint n Control and Status Register
    __IO uint32_t IER;          //!< 0x018          USB Endpoint n Interrupt Enable Register
    __IO uint32_t ISR;          //!< 0x01C          USB Endpoint n Interrupt Status Register
    __IO uint32_t TCR;          //!< 0x020          USB Endpoint n Transfer Count Register
    __IO uint32_t CFGR;         //!< 0x024          USB Endpoint n Configuration Register
  } EP[8];
} USB_TypeDef;

// USBCSR
#define USBCSR_FRES         (0x002)        // Force USB Reset Control
#define USBCSR_PDWN         (0x004)        // Power Down Mode Control
#define USBCSR_LPMODE       (0x008)        // Low-Power Mode Control
#define USBCSR_GENRSM       (0x020)        // Resume Request Generation Control
#define USBCSR_RXDP         (0x040)        // Received DP Line Status
#define USBCSR_RXDM         (0x080)        // Received DM Line Status
#define USBCSR_ADRSET       (0x100)        // Device Address Setting Control
#define USBCSR_SRAMRSTC     (0x200)        // USB SRAM Reset Condition
#define USBCSR_DPPUEN       (0x400)        // DP Pull Up Enable
#define USBCSR_DPWKEN       (0x800)        // DP Wake Up Enable

// USBIER
#define USBIER_UGIE         (0x0001)       // USB global Interrupt Enable
#define USBIER_SOFIE        (0x0002)       // Start Of Frame Interrupt Enable
#define USBIER_URSTIE       (0x0004)       // USB Reset Interrupt Enable
#define USBIER_RSMIE        (0x0008)       // Resume Interrupt Enable
#define USBIER_SUSPIE       (0x0010)       // Suspend Interrupt Enable
#define USBIER_ESOFIE       (0x0020)       // Expected Start Of Frame Enable
#define USBIER_EP0IE        (0x0100)       // Endpoint 0 Interrupt Enable
#define USBIER_EP1IE        (0x0200)       // Endpoint 1 Interrupt Enable
#define USBIER_EP2IE        (0x0400)       // Endpoint 2 Interrupt Enable
#define USBIER_EP3IE        (0x0800)       // Endpoint 3 Interrupt Enable
#define USBIER_EP4IE        (0x1000)       // Endpoint 4 Interrupt Enable
#define USBIER_EP5IE        (0x2000)       // Endpoint 5 Interrupt Enable
#define USBIER_EP6IE        (0x4000)       // Endpoint 6 Interrupt Enable
#define USBIER_EP7IE        (0x8000)       // Endpoint 7 Interrupt Enable

// USBISR
#define USBISR_SOFIF        (0x0002)       // Start Of Frame Interrupt Flag
#define USBISR_URSTIF       (0x0004)       // USB Reset Interrupt Flag
#define USBISR_RSMIF        (0x0008)       // Resume Interrupt Flag
#define USBISR_SUSPIF       (0x0010)       // Suspend Interrupt Flag
#define USBISR_ESOFIF       (0x0020)       // Expected Start Of Frame Interrupt
#define USBISR_EP0IF        (1U << 8)      // Endpoint 0 Interrupt Flag
#define USBISR_EP1IF        (1U << 9)      // Endpoint 1 Interrupt Flag
#define USBISR_EP2IF        (1U << 10)     // Endpoint 2 Interrupt Flag
#define USBISR_EP3IF        (1U << 11)     // Endpoint 3 Interrupt Flag
#define USBISR_EP4IF        (1U << 12)     // Endpoint 4 Interrupt Flag
#define USBISR_EP5IF        (1U << 13)     // Endpoint 5 Interrupt Flag
#define USBISR_EP6IF        (1U << 14)     // Endpoint 6 Interrupt Flag
#define USBISR_EP7IF        (1U << 15)     // Endpoint 7 Interrupt Flag
#define USBISR_EPnIF        (0xFF00)       // Endpoint Interrupt Mask

// USBFCR
#define USBFCR_FRNUM        (0x7FF)        // Frame Number
#define USBFCR_SOFLCK       (1U << 16)     // Start-of-Frame Lock Flag
#define USBFCR_LSOF         (0x3U << 17)   // Lost Start-of-Frame Number

// USBEPnCSR
#define USBEPnCSR_DTGTX     (0x01)         // Data Toggle Status, for IN transfer
#define USBEPnCSR_NAKTX     (0x02)         // NAK Status, for IN transfer
#define USBEPnCSR_STLTX     (0x04)         // STALL Status, for IN transfer
#define USBEPnCSR_DTGRX     (0x08)         // Data Toggle Status, for OUT transfer
#define USBEPnCSR_NAKRX     (0x10)         // NAK Status, for OUT transfer
#define USBEPnCSR_STLRX     (0x20)         // STALL Status, for OUT transfer

// USBEPnIER
#define USBEPnIER_OTRXIE    (0x001)        // OUT Token Received Interrupt Enable
#define USBEPnIER_ODRXIE    (0x002)        // OUT Data Received Interrupt Enable
#define USBEPnIER_ODOVIE    (0x004)        // OUT Data Buffer Overrun Interrupt Enable
#define USBEPnIER_ITRXIE    (0x008)        // IN Token Received Interrupt Enable
#define USBEPnIER_IDTXIE    (0x010)        // IN Data Transmitted Interrupt Enable
#define USBEPnIER_NAKIE     (0x020)        // NAK Transmitted Interrupt Enable
#define USBEPnIER_STLIE     (0x040)        // STALL Transmitted Interrupt Enable
#define USBEPnIER_UERIE     (0x080)        // USB Error Interrupt Enable
#define USBEPnIER_STRXIE    (0x100)        // SETUP Token Received Interrupt Enable
#define USBEPnIER_SDRXIE    (0x200)        // SETUP Data Received Interrupt Enable
#define USBEPnIER_SDERIE    (0x400)        // SETUP Data Error Interrupt Enable
#define USBEPnIER_ZLRXIE    (0x800)        // Zero Length Data Received Interrupt Enable

// USBEPnISR
#define USBEPnISR_OTRXIF    (0x001)        // OUT Token Received Interrupt Flag
#define USBEPnISR_ODRXIF    (0x002)        // OUT Data Received Interrupt Flag
#define USBEPnISR_ODOVIF    (0x004)        // OUT Data Buffer Overrun Interrupt Flag
#define USBEPnISR_ITRXIF    (0x008)        // IN Token Received Interrupt Flag
#define USBEPnISR_IDTXIF    (0x010)        // IN Data Transmitted Interrupt Flag
#define USBEPnISR_NAKIF     (0x020)        // NAK Transmitted Interrupt Flag
#define USBEPnISR_STLIF     (0x040)        // STALL Transmitted Interrupt Flag
#define USBEPnISR_UERIF     (0x080)        // USB Error Interrupt Flag
#define USBEPnISR_STRXIF    (0x100)        // SETUP Token Received Interrupt Flag
#define USBEPnISR_SDRXIF    (0x200)        // SETUP Data Received Interrupt Flag
#define USBEPnISR_SDERIF    (0x400)        // SETUP Data Error Interrupt Flag
#define USBEPnISR_ZLRXIF    (0x800)        // Zero Length Data Received Interrupt Flag

// USBEPnTCR
#define USBEPnTCR_TCNT      (0x1FF)        // Transfer Byte Count

// USBEPnCFGR
#define USBEPnCFGR_EPEN     (1U << 31)     // Endpoint Enable
#define USBEPnCFGR_EPTYPE   (1U << 29)     // Transfer Type
#define USBEPnCFGR_EPDIR    (1U << 28)     // Transfer Direction
#define USBEPnCFGR_EPADR    (0xFU << 24)   // Endpoint Address
#define USBEPnCFGR_EPLEN    (0x7FU << 10)  // Buffer Length
#define USBEPnCFGR_EPBUFA   (0x3FF)        // Endpoint Buffer Address

// Peripheral Direct Memory Access
// /////////////////////////////////////////////////////////////////////////////

// Extend Bus Interface
// /////////////////////////////////////////////////////////////////////////////

// Inter-IC Sound
// /////////////////////////////////////////////////////////////////////////////

// CRC
// /////////////////////////////////////////////////////////////////////////////
